In [1]:
import sqlite3
import pandas as pd

In [2]:
db = sqlite3.connect('school.sqlite')

In [3]:
data=pd.read_sql_query("select * from student",db)  #pass quer and conn object
data

   rollnumber     name  age
0         101     Aman   30
1         102     Amit   24
2         103    Mohit   50
3         104   Nikhil   30
4         105    Nidhi   30
5         106  Manisha   30
6         107   Ankush   30

Advantage-- no need to create cursor
we get dataframe

In [4]:
data[data['age']==30]

   rollnumber     name  age
0         101     Aman   30
3         104   Nikhil   30
4         105    Nidhi   30
5         106  Manisha   30
6         107   Ankush   30

In [5]:
# creating new table with pandas

#creating dataframe
data = pd.DataFrame([[201,"abc","eng",20000],[202,"komal","math",20000],[203,"xyc","science",24000]],columns=["id","name","course","salary"])

print(data)

    id   name   course  salary
0  201    abc      eng   20000
1  202  komal     math   20000
2  203    xyc  science   24000

In [6]:
data.to_sql("facaulty",db)  #table_name and conn obj

3

In [10]:
#updating a table

data=pd.read_sql_query("select * from student",db) 
data["address"]="test"  #adding a new column

data.to_sql("student",db,if_exists="replace")  #replacing old table with new dataframe

7